# Задание 2. Таблица истинности

## Условие

Миша заполнял таблицу истинности логической функции F

**(x ∧ ¬y) ∨ (y ≡ z) ∨ w**

но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.

| ??? | ??? | ??? | ??? | F |
|:---:|:---:|:---:|:---:|:-:|
| 1   |     |     | 0   |   |
| 1   | 0   | 0   | 0   | 0 |
| 1   | 0   |     | 1   | 0 |

Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.

В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

### Пример

Функция F задана выражением **¬x ∨ y**, зависящим от двух переменных, а фрагмент таблицы имеет следующий вид:

| ??? | ??? | F |
|:---:|:---:|:-:|
| 0   | 1   | 0 |

Тогда первому столбцу соответствует переменная y, а второму столбцу — переменная x. В ответе нужно написать: **yx**

---

## Решение

Составим таблицу истинности для выражения **(x ∧ ¬y) ∨ (y ≡ z) ∨ w** при помощи языка Python:

```python
from itertools import product

print("x y z w")
for x, y, z, w in product([0, 1], repeat=4):
    if not ((x and not y) or (y == z) or w):
        print(x, y, z, w)
```

Далее выпишем те наборы переменных, при которых данное выражение равно 0. В наборах переменные запишем в порядке x, y, z, w. Получим следующие наборы:

- (0, 0, 1, 0)
- (0, 1, 0, 0)
- (1, 1, 0, 0)

Сопоставим эти наборы с приведенным в задании фрагментом таблицы истинности.

1. Заметим, что только во втором столбце таблицы истинности нет единиц. Следовательно, второй столбец может быть только переменной **w**.

2. Первый столбец может быть только переменной **y**, так как только в этом столбце переменная принимает значение двух единиц.

3. Рассмотрим третью строку таблицы. Эта строка может соответствовать только набору (1, 1, 0, 0). Следовательно, четвертый столбец может соответствовать только переменной **x**, так как в этом наборе есть две единицы, а первая принадлежит y. Тогда третий столбец соответствует переменной **z**.

---

## Ответ

**ywzx**
